<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\DB;

class GroupSpecialtySeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $data = [];

        $data[] = ['name' => "Прикладная информатика"];
        $data[] = ['name' => "Педагогическое образование: Физика"];
        $data[] = ['name' => "Педагогическое образование: Математика и информатика"];
        $data[] = ['name' => "Педагогическое образование: Физическая культура"];
        $data[] = ['name' => "Педагогическое образование: Начальное образование, Изобразительное искусство"];
        $data[] = ['name' => "Педагогическое образование: Дошкольное образование"];
        $data[] = ['name' => "Педагогическое образование: История и право"];
        $data[] = ['name' => "Педагогическое образование: Русский язык и Литература"];
        $data[] = ['name' => "Педагогическое образование: Родной (башкирский) язык"];
        $data[] = ['name' => "Педагогическое образование: Иностранный язык (английский, французский)"];
        $data[] = ['name' => "Педагогическое образование: Технология и предпринимательство"];

        $data[] = ['name' => "Экология и природопользование"];
        $data[] = ['name' => "Химия"];
        $data[] = ['name' => "Социальная работа"];
        $data[] = ['name' => "Психология и социальная педагогика"];
        $data[] = ['name' => "Инженерная защита окружающей среды"];

        DB::table('group_specialties')->insert($data);
    }
}
